from .lexicon_src_contacts import *

LEXICON_SRC_RU: dict[str, str] = {
    '/start': 'Вы можете выполнить несколько дыхательных упражнений, пройти тесты или сразу перейти в канал👇🏽'
}

LEXICON_SRC_COMMANDS_RU: dict[str, str] = {
                '/1': 'Упражнения',
                '/2': 'Тесты',
                '/3': 'ПЕРЕЙТИ НА КАНАЛ'
                }

LEXICON_SRC_HI_RU: dict[str, str] = {
    '/2': 'Онлайн тест на уровень вашей осознанности и стремление к саморазвитию - qvilon.ru \n\n'
          'Успешный процесс саморазвития зависит не только от желания личности. Он обусловлен рядом таких факторов, как способность к самоорганизации, умение адекватно, реально оценивать свои возможности, а также применять их на практике, рабочей деятельности. Давайте же проверим, насколько вы способны к саморазвитию? Пройдите тест на саморазвитие и узнайте свой результат. https://qvilon.ru/testy/na-samorazvitie.html \n\n'
          'Тест на ограничивающие установки',
    '/1': '<b>5 дыхательных упражнений, чтобы справиться с тревогой</b>👇🏽\n\n'
            'Дыхание — лучший помощник в расслаблении! \n\n' 
            'Первое упражнение. Утреннее диафрагмальное дыхание.\n\n'
            'Начинайте каждый день с глубокого диафрагмального дыхания, это займет не больше 3–5 минут, но поможет с самого утра настроить концентрацию. \n\n'
            'Суть проста:\n\n'
            '1. примите удобную позу: глаза закрыты, тело расслабленно;\n\n'
            '2. положите правую руку на живот в   районе пупка, а левую — на грудь;\n\n'
             '3. дышите — при вдохе работайте животом так, чтобы правая рука начала подниматься и опускаться, а левая — не двигалась \n\n'
             'Готово! Теперь вы готовы покорять этот день!',
    '/3': 'GO'
    }


LEXICON_SRC_COMMANDS_RU_TEST: dict[str, str] = {
                '/1t': 'Осознанность',
                '/2t': 'Эмоции',
                '/3t': 'Сильные стороны',
                }

LEXICON_SRC_COMMANDS_RU_UPR: dict[str, str] = {
                '/1u': '1️⃣ упражнение',
                '/2u': '2️⃣ упражнение',
                '/3u': '3️⃣ упражнение',
                '/4u': '4️⃣ упражнение'
                }


LEXICON_SRC_HI_RU_TEST: dict[str, str] = {
          '/1t': '<b>Онлайн тест на уровень вашей осознанности и стремление к саморазвитию</b> - qvilon.ru \n\n'
          'Успешный процесс саморазвития зависит не только от желания личности. Он обусловлен рядом таких факторов, как способность к самоорганизации, умение адекватно, реально оценивать свои возможности, а также применять их на практике, рабочей деятельности. Давайте же проверим, насколько вы способны к саморазвитию? Пройдите тест на саморазвитие и узнайте свой результат. \n\n'
          'https://qvilon.ru/testy/na-samorazvitie.html',
          '/2t': '<b>Методика Элиса (тест на Ирациональные установки) — онлайн тест </b>\n\n'
          'Негативные эмоции появляются у людей не вследствие окружающих их событий, а вследствие их негативной интерпретации людьми из-за иррациональных убеждений, усвоен ...\n\n'
          'https://www.b17.ru/tests/195/',
          '/3t': '<b>Тест на сильные стороны вашего характера</b> \n\n'
          'Тест на определение сильных сторон характера \n\n'
          'У каждого из нас есть сильные и слабые стороны. Пройди тест и узнай, какие сильные стороны есть у тебя!\n\n'
          'https://quizterra.com/ru/kakie-samye-silnye-storony-tvoego-haraktera',

}

LEXICON_SRC_HI_RU_UPR: dict[str, str] = {
          '/1u': '<b>Дыхание — лучший помощник в расслаблении!</b> \n\n' 
            'Первое упражнение. Утреннее диафрагмальное дыхание.\n\n'
            'Начинайте каждый день с глубокого диафрагмального дыхания, это займет не больше 3–5 минут, но поможет с самого утра настроить концентрацию. \n\n'
            'Суть проста:\n\n'
            '1. примите удобную позу: глаза закрыты, тело расслабленно;\n\n'
            '2. положите правую руку на живот в   районе пупка, а левую — на грудь;\n\n'
             '3. дышите — при вдохе работайте животом так, чтобы правая рука начала подниматься и опускаться, а левая — не двигалась \n\n'
             'Готово! Теперь вы готовы покорять этот день!',
          '/2u': '<b>Техника ”В любой непонятной ситуации — выдыхай”</b>\n\n'
          'Мало кто любит поездки на общественном транспорте до офиса, согласитесь?  \n\n'
          'Так вот! Если вы снова окзались в метро в час пик и чувствуете себя крайне дискомфортно, постарайтесь сконцентрироваться на дыхании: вдыхайте пять секунд, выдыхайте десять.\n\n'
          'Повторите упражнение пять раз!',
          '/3u': '🧠<b>Прогрессивная мышечная релаксация по Джекобсону</b>\n\n'
          'Способ, при котором путем сознательного напряжения мышц, достигается состояние глубокой релаксации всего тела. \n\n'
          'Последовательно, в течение нескольких секунд напрягайте каждую мышцу вашего тела.\n\n'
          'Важно фокусироваться на изменении между напряжением и расслаблением, а также на возникающих при этом ощущениях.\n\n'
          'Целью процесса является уменьшение мышечного напряжения благодаря глубокому пониманию своего тела. Видео для примера👇🏽'
          'https://www.youtube.com/watch?time_continue=1&v=o6Ii0vxIF74&feature=emb_logo',
          '/4u': '<b>Упражнение ”Связка ключей Фрейда”</b>🗝️ \n\n'
          '1. Возьмите связку ключей. Держите ее так, чтобы она упала на пол, если вы разожмете ладонь.\n\n'
          '2. Закройте глаза. Сделайте три глубоких вдоха. Вдыхайте через нос, выдыхайте через рот. Расслабьтесь. \n\n'
          '3. Сосредоточьте свое внимание сначала на одной, потом на другой группе мышц, почувствуйте, как они полностью расслабляются. Не забудьте расслабить лицо и плечи!Дышите в привычном ритме.\n\n'
          '4. Постарайтесь уснуть. Как только вы достигнете фазы, в которой теряется контроль над телом, вы уроните ключи — упражнение завершится.\n\n'
          'К моменту, когда вы проснетесь от удара ключей об пол, вы успеете сделать идеальную короткую паузу, которая позволит продолжить рабочие дела с максимальной концентрацией и продуктивностью.',
          '/5u': 'Упражнение ”Короткий отдых по Бертрану”🧘🏽‍♀️\n\n'
          '1. Сядьте как можно удобнее. Поставьте ступни на пол. Руки свободно положите на колени. Закройте глаза. Сделайте три глубоких вдоха и выдоха.\n\n'
          '2. Представьте ступни внутри носков и ботинок, ощутите их полное расслабление. Почувствуйте свободу в ногах и бедрах, попробуйте расслабить их еще больше. Проделайте то же самое с ягодицами и спиной. \n\n'
          '3. Диафрагма должна подниматься и опускаться в такт дыханию. Убедитесь, что челюсти и все остальные мышцы тела тоже расслаблены. \n\n'
          '4. Сделайте три глубоких вдоха и выдоха.\n\n'
          '5. В течение минуты концентрируйтесь на дыхании. Следите, как воздух проходит через нос, движется по телу и наполняет легкие, затем как он выходит наружу. \n\n'
          '6. Представьте, что у вас есть камера, которая фиксирует вдохи и выдохи. В течение двух-трех минут представляйте жизнь вашей мечты. Вообразите, что достигли одной или нескольких больших целей. Используйте все органы чувств! Прочувствуйте, что означает достичь того, что заслуживаешь. \n\n'
          # '7. В конце упражнения — около минуты — просто дышите. Постарайтесь очистить голову от всех мыслей.\n\n'
}




